test_cloud.yml
---
execution:
- concurrency: 10
  hold-for: 2m
  ramp-up: 60s
  location:
      us-east-1: 2
      us-west-1: 2
  locations-weighted: false
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php